app/controllers/bams_controller.rb

  def index
    @bams = Bam.all
---
SELECT "BAMS".* FROM "BAMS"

  def update
    respond_to do |format|
      if @bam.update(bam_params)
---
UPDATE "BAMS" SET "MODEL" = :a1, "RENOVATION_AT" = :a2, "LAST_ASSIGN_AT" = :a3, "UPDATED_AT" = :a4 WHERE "BAMS"."ID" = :a5  [["model", "Huawei E5573"], ["renovation_at", "2020-01-08 14:12:26"], ["last_assign_at", "2018-01-08 14:12:00"], ["updated_at", "2018-01-08 15:10:18.060463"], ["id", 10008]]

    def set_bam
      @bam = Bam.find(params[:id])
---
SELECT  "BAMS".* FROM "BAMS" WHERE "BAMS"."ID" = :a1 AND ROWNUM <= :a2   [["id", 10008], ["LIMIT", 1]]