app/controllers/plans_controller.rb

  def index
  @search = Plan.search(params[:q])
---
SELECT id, name FROM "PLANS" WHERE ((plan_type = 'plan' OR plan_type = 'bag') AND item= 'roaming')

  def update
    respond_to do |format|
      if @plan.update(plan_params)
---
UPDATE "PLANS" SET "NID_COUNTRY" = :a1, "UPDATED_AT" = :a2 WHERE "PLANS"."ID" = :a3  [["nid_country", "ARG"], ["updated_at", "2018-01-08 15:07:40.631706"], ["id", 10005]]

    def set_plan
      @plan = Plan.find(params[:id])
---
SELECT  "PLANS".* FROM "PLANS" WHERE "PLANS"."ID" = :a1 AND ROWNUM <= :a2   [["id", 10005], ["LIMIT", 1]]