app/controllers/requests_controller.rb

    def set_request
      @request = Request.find(params[:id])
---
SELECT  "REQUESTS".* FROM "REQUESTS" WHERE "REQUESTS"."ID" = :a1 AND ROWNUM <= :a2   [["id", 10002], ["LIMIT", 1]]