app/controllers/requests_controller.rb

SELECT "REQUESTS".* FROM "REQUESTS" ORDER BY "REQUESTS"."CREATED_AT" DESC
---
  def index
    @search = Request.search(params[:q])

SELECT  "REQUESTS".* FROM "REQUESTS" WHERE "REQUESTS"."LINK" = :a1 AND ROWNUM <= :a2   [["link", "374f84a84298003bf60495e5439196b3342a183eda4999f48df2b7a3253049df"], ["LIMIT", 1]]
---
  def validations
    # find request
    @request = Request.find_by_link(params[:id])

INSERT INTO "REQUESTS" ("REQUEST", "ITEM", "MODEL", "FILE", "FILE_TYPE", "FILE_NAME", "COMMENT", "COMMENT_STOLEN_LOST", "EMAIL_SENDED", "WANT_SIM", "NUMBER_TYPE", "PRICE", "NAME", "NATIONAL_ID", "EMAIL", "COMPANY", "DEPTNAME", "START_DATE", "USER_ID", "CREATED_AT", "UPDATED_AT", "ID") VALUES (:a1, :a2, :a3, :a4, :a5, :a6, :a7, :a8, :a9, :a10, :a11, :a12, :a13, :a14, :a15, :a16, :a17, :a18, :a19, :a20, :a21, :a22)
UPDATE "REQUESTS" SET "LINK" = :a1, "UPDATED_AT" = :a2 WHERE "REQUESTS"."ID" = :a3  [["link", "a6b65a173500daae7ec24755f4a9822a6896b0d3dad154aad09bf4606f153914"], ["updated_at", "2018-02-09 20:25:13.061980"], ["id", 10004]]
---

    Request.transaction do
      # If request was successfully created
      if @request.save

SELECT  "USERS".* FROM "USERS" WHERE "USERS"."ID" = :a1 AND ROWNUM <= :a2   [["id", 10000], ["LIMIT", 1]]
---
        @request.update_attribute("link", url)

        # Send mails
        user = User.find_by_id(params[:user_id])

SELECT  "REQUESTS".* FROM "REQUESTS" WHERE "REQUESTS"."LINK" = :a1 AND ROWNUM <= :a2   [["link", "cdea527ba7e5c3d035f7691889fc1c966510b4062da453ca68bd8865f21b682a"], ["LIMIT", 1]]
SELECT  "REQUESTS".* FROM "REQUESTS" WHERE "REQUESTS"."N_REQUEST" = :a1 AND ROWNUM <= :a2   [["n_request", "100009996"], ["LIMIT", 1]]
---
    def set_request
      puts(params[:id])
      @request = Request.find_by_link(params[:id])
      if !@request and params.has_key?(:n_request)
        params[:n_request].strip!
        @request = Request.find_by_n_request(params[:n_request])