app/controllers/sims_controller.rb

SELECT "SIMS".* FROM "SIMS"
---
  def index
    @sims = Sim.all

SELECT  "sims".* FROM "sims" WHERE "sims"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def set_sim
      @sim = Sim.find(params[:id])