app/controllers/smartphones_controller.rb

  def index
    @smartphones = Smartphone.all
---
SELECT "SMARTPHONES".* FROM "SMARTPHONES"

    def set_smartphone
      @smartphone = Smartphone.find(params[:id])
---
SELECT  "SMARTPHONES".* FROM "SMARTPHONES" WHERE "SMARTPHONES"."ID" = :a1 AND ROWNUM <= :a2   [["id", 10030], ["LIMIT", 1]]