app/controllers/user_records_controller.rb

SELECT "user_records".* FROM "user_records"
---
  def index
    @user_records = UserRecord.all