app/views/layouts/_email_request.html.erb

INSERT INTO "REQUESTS" ("REQUEST", "ITEM", "MODEL", "FILE", "FILE_TYPE", "FILE_NAME", "COMMENT", "COMMENT_STOLEN_LOST", "EMAIL_SENDED", "WANT_SIM", "NUMBER_TYPE", "PRICE", "NAME", "NATIONAL_ID", "EMAIL", "COMPANY", "DEPTNAME", "START_DATE", "USER_ID", "CREATED_AT", "UPDATED_AT", "ID") VALUES (:a1, :a2, :a3, :a4, :a5, :a6, :a7, :a8, :a9, :a10, :a11, :a12, :a13, :a14, :a15, :a16, :a17, :a18, :a19, :a20, :a21, :a22)
---
        <td><strong>Fecha Creación:</strong></td>
        <td><%= @request.created_at.localtime.strftime('%d/%m/%Y %H:%M:%S') %></td>