app/views/layouts/_plan_filter.html.erb

SELECT id, name FROM "PLANS" WHERE ((plan_type = 'plan' OR plan_type = 'bag') AND item= 'roaming')
---
          <%= form.label :plan_type_eq, "Tipo", class: "pull-left"%>
          <%= form.select :plan_type_eq, [['Todo',''],['Plan','plan'],
          ['Bolsa','bag']], {},
          {id: "2", style: "width:120px", class: "pull-right"}%>